// BOJ 11726번 2*N 타일링
// https://www.acmicpc.net/problem/11726

import java.util.Scanner;

public class Main {
	public static void main(String[] args) {
		Scanner sc = new Scanner(System.in);

		int N = sc.nextInt();

		/*  
		 * 	N = 2
		 *  -> dp[2] = 2
		 *  | | 	ㅡ ㅡ
		 * 	| | 	ㅡ ㅡ
		 * 	
		 * 
		 *  N = 3
		 *  -> dp[3] = 3
		 *  | | | 	| ㅡ ㅡ 	ㅡ ㅡ |
		 * 	| | | 	| ㅡ ㅡ 	ㅡ ㅡ |
		 * 	
		 * 
		 *  N = 4
		 *  -> dp[4] = 5
		 *  | | | | 	ㅡ ㅡ ㅡ ㅡ 
		 * 	| | | | 	ㅡ ㅡ ㅡ ㅡ 
		 * 
		 *  | | ㅡ ㅡ 	| ㅡ ㅡ | 	ㅡ ㅡ | |
		 *  | | ㅡ ㅡ 	| ㅡ ㅡ | 	ㅡ ㅡ | |
		 *  
		 *  N = 5
		 *  -> dp[5] = 8
		 *  | | | | |
		 * 	| | | | |
		 * 
		 *  | | | ㅡ ㅡ 		| | ㅡ ㅡ | 		| ㅡ ㅡ | | 		ㅡ ㅡ ㅡ | |
		 *  | | | ㅡ ㅡ 		| | ㅡ ㅡ | 		| ㅡ ㅡ | | 		ㅡ ㅡ ㅡ | |
		 *  
		 *  | ㅡ ㅡ ㅡ ㅡ 		ㅡ ㅡ | ㅡ ㅡ 		ㅡ ㅡ ㅡ ㅡ |
		 *  | ㅡ ㅡ ㅡ ㅡ 		ㅡ ㅡ | ㅡ ㅡ 		ㅡ ㅡ ㅡ ㅡ |
		 *  
		 *  N = 6
		 *  -> dp[6] = 13
		 *  | | | | | |		ㅡ ㅡ ㅡ ㅡ ㅡ ㅡ
		 * 	| | | | | |		ㅡ ㅡ ㅡ ㅡ ㅡ ㅡ
		 * 
		 *  | | | | ㅡ ㅡ 	| | | ㅡ ㅡ | 	| | ㅡ ㅡ | | 	| ㅡ ㅡ ㅡ | |	ㅡ ㅡ ㅡ | | |
		 *  | | | | ㅡ ㅡ 	| | | ㅡ ㅡ | 	| | ㅡ ㅡ | | 	| ㅡ ㅡ ㅡ | |	ㅡ ㅡ ㅡ | | |
		 *  
		 *  | | ㅡ ㅡ ㅡ ㅡ 	ㅡ ㅡ | | ㅡ ㅡ 	ㅡ ㅡ ㅡ ㅡ | |
		 *  | | ㅡ ㅡ ㅡ ㅡ 	ㅡ ㅡ | | ㅡ ㅡ 	ㅡ ㅡ ㅡ ㅡ | |
		 *  
		 *  | ㅡ ㅡ | ㅡ ㅡ  	ㅡ ㅡ | ㅡ ㅡ | 	| ㅡ ㅡ ㅡ ㅡ |
		 *  | ㅡ ㅡ | ㅡ ㅡ  	ㅡ ㅡ | ㅡ ㅡ | 	| ㅡ ㅡ ㅡ ㅡ |
		 *   
		 */
		
		int[] dp = new int[Math.max(N + 1, 2)];
		dp[0] = 1;
		dp[1] = 1;
		
		if (N >= 2) {
			for (int i = 2; i < N + 1; i++) {
				dp[i] = (dp[i - 1] + dp[i - 2]) % 10007;
			}			
		}

		// 결과 출력
		System.out.println(dp[N]);
	}
}
